main.floors.MT0=
{
    "floorId": "MT0",
    "title": "洞穴",
    "name": "0",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "T331",
    "images": [],
    "ratio": 1,
    "map": [
    [20049,20049,20049,20049,20049,20049,20050, 91,20048,20049,20049,20049,20049,20049,20043],
    [20057,20057,20057,20057,20057,20057,20058,  0,20056,20057,20057,20057,20057,20057,20040],
    [20065,20065,20065,20065,20065,20065,20074,  0,20064,20065,20065,20065,20065,20065,20040],
    [141,141,141,141,  0,  0,  0,  0,  0,  0,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,  0,  0,141,  0,494,482,482,20040],
    [141, 33, 33,492,  0,141,  0,  0,  0,141,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,  0,  0,141,  0,141,141,141,20040],
    [141,141,141,141,  0,  0,  0,141,  0,  0,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,  0,  0,141,  0,494,482,482,20040],
    [141, 33, 33,492,  0,141,  0,  0,  0,141,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,559,  0,141,  0,141,141,141,20040],
    [141,141,141,141,  0,129,558, 46,560,  0,  0,141, 33, 33,20040],
    [141, 33, 33,141,  0,141,367,  0,129,141,  0,494,482,482,20040],
    [141, 33, 33,492,  0,141,  0,  0,129,141,  0,141, 33, 33,20040],
    [141,141,141,141,141,141,141,141,141,141,141,141,141,141,20040]
],
    "firstArrive": [
        "\t[原始人]\b[up,hero]家里柴火不够了，今天又要去砍柴了啊",
        "\t[原始人]\b[up,hero]最好还能带点食物回来",
        "\t[原始人]\b[up,hero]希望不要遇到什么凶猛的动物吧",
        "\t[原始人]\b[up,hero]......",
        "\t[原始人]\b[up,hero]家里面那些奇怪的石头还是没办法移走",
        "\t[原始人]\b[up,hero]之后再想办法吧",
        "请耐心等待字体加载完成，否则很多地方显示会很奇怪，大概需要十秒，过一段时间打开任意界面再关闭即可",
        {
            "type": "function",
            "function": "function(){\ncore.displayChapter(0);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,12": [
            "\t[原始人]\b[up,hero]出去找些柴火"
        ],
        "8,13": [
            "本塔有很多新的功能，所有的说明都详细地写在了前方的百科全书里面，里面包含所有的功能说明，不阅读可能会影响正常的游戏体验，请仔细阅读。"
        ],
        "8,12": [
            "该塔计分方式：生命+5000*黄钥匙+15000*蓝钥匙"
        ],
        "5,11": [
            "原声音乐可以在网易云音乐搜索：魔塔 人类：开天辟地 bgm，部分音乐因为版权问题可能无法播放或者不在歌单内"
        ]
    },
    "changeFloor": {
        "7,0": {
            "floorId": "MT1",
            "loc": [
                7,
                14
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "7,11": [
            {
                "type": "setValue",
                "name": "flag:usePlatFly",
                "value": "true"
            },
            {
                "type": "setValue",
                "name": "flag:__useMinimap__",
                "value": "true"
            }
        ],
        "6,11": [
            "这个可以查看bgm，也可以设置bgm，也可以清空设置的bgm"
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 15,
    "height": 15,
    "autoEvent": {},
    "bgm": "cave.mp3",
    "beforeBattle": {},
    "bg2map": [

],
    "fg2map": [

],
    "cannotMoveIn": {}
}