main.floors.MT0=
{
    "floorId": "MT0",
    "title": "洞穴",
    "name": "0",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "T331",
    "images": [],
    "ratio": 1,
    "map": [
    [20049,20049,20049,20049,20049,20049,20050, 91,20048,20049,20049,20049,20049,20049,20043],
    [20057,20057,20057,20057,20057,20057,20058,  0,20056,20057,20057,20057,20057,20057,20040],
    [20065,20065,20065,20065,20065,20065,20074,  0,20064,20065,20065,20065,20065,20065,20040],
    [141,141,141,141,  0,  0,  0,  0,  0,  0,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,  0,  0,141,  0,494,482,482,20040],
    [141, 33, 33,492,  0,141,  0,  0,  0,141,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,  0,  0,141,  0,141,141,141,20040],
    [141,141,141,141, 92,  0,  0,141,  0,  0,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141,  0,  0,  0,141,  0,494,482,482,20040],
    [141, 33, 33,492,  0,141,  0,642,  0,141,  0,141, 33, 33,20040],
    [141, 34, 34,141,  0,141, 45,559, 46,141,  0,141,141,141,20040],
    [141,141,141,141,  0,  0,558,  0,560,  0,  0,141, 33, 33,20040],
    [141, 33, 33,141,  0,141,367,  0,129,141,  0,494,482,482,20040],
    [141, 33, 33,492,  0,141,129,  0,129,141,  0,141, 33, 33,20040],
    [141,141,141,141,141,141,141,141,141,141,141,141,141,141,20040]
],
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                0
            ],
            "time": 500,
            "keep": true
        },
        "\t[原始人]又到了秋天，天气开始变凉了",
        "秋风从石头的缝隙中穿过，原始人站在山洞中，感受着秋风的凉意，心中涌起一丝熟悉的紧迫感。",
        "他知道，随着秋天的到来，山上的树木将变得干燥，而山火的风险也会随之增加。",
        "他也知道，每一次暴雨过后，山洞外的河流可能会泛滥，淹没他们的狩猎场。",
        "\t[原始人]柴火的消耗逐渐变多了，看来需要再上山砍柴了啊。",
        "他从石头的缝隙中看去，看到满山的枫叶在秋风中摇曳，仿佛在提醒他时间的流逝。",
        "这些自然的变迁，虽然无情，却也教会了他如何适应和生存。",
        "\t[原始人]今天的天气似乎不错，那就上山看看吧。",
        "\r[red]注意！！！\r[]该塔新增了很多新的功能，同时对样板的ui进行了大幅度的改动，操作也有改变，由于内容过多，这里不再一一描述，具体请在道具栏查看百科全书！！百科全书是在你面前的几个道具中的其中一个",
        {
            "type": "function",
            "function": "function(){\nif (!core.isReplaying()) Mota.require('@motajs/legacy-ui').fixedUi.open('chapter', { chapter: '序章  起源' });\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,12": [
            "\t[原始人]\b[up,hero]出去找些柴火"
        ],
        "8,13": [
            "本塔有很多新的功能，所有的说明都详细地写在了前方的百科全书里面，里面包含所有的功能说明，不阅读可能会影响正常的游戏体验，请仔细阅读。",
            "例如你现在首先感受到的应该是状态栏的变动，你可以打开百科全书阅读状态栏相关内容。里面包含状态栏的功能说明与布局说明等。",
            "注意百科全书中的内容非常基础详细，如果对魔塔有一定的了解，可以选择性地阅读。",
            "打开百科全书的快捷键是H"
        ],
        "8,12": [
            "第一章计分方式：生命+5000*黄钥匙+15000*蓝钥匙"
        ],
        "6,13": [
            "原声音乐可以在网易云音乐搜索：魔塔 人类：开天辟地 bgm，部分音乐因为版权问题可能无法播放或者不在歌单内"
        ],
        "3,7": [
            "这里允许你跳转到第二章。如果你没玩过第一章，那么建议自己游玩，如果玩过却又不想再打一遍，可以由此跳转",
            {
                "type": "confirm",
                "text": "是否跳转到第二章？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nMota.require('@motajs/legacy-ui').swapChapter(2, flags.hard);\n}"
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "7,0": {
            "floorId": "MT1",
            "loc": [
                7,
                14
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "6,11": [
            "这个可以查看bgm，也可以设置bgm，也可以清空设置的bgm"
        ],
        "8,11": [
            "请仔细阅读这个道具内的说明",
            "注意，虽然内容很多，但是大部分都是“无用”信息，例如对那些ui的说明，基本上打开ui后就能看出来不同区域的功能的，百科全书的说明基本只是对一些细节进行了说明。因此一般来说是不需要非常认真地读关于ui的信息的。",
            "而对于那些新的内容，例如怪物标记等，可能需要阅读一下。",
            "这里说一个非常重要的一点，那就是本塔中几乎所有ui都是可以滚动的，尝试用滚轮或者手指拖动进行滚动，包括状态栏！"
        ],
        "7,10": [
            "里面包含了所有游戏的设置，请仔细查看设置"
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [

],
    "fgmap": [

],
    "width": 15,
    "height": 15,
    "autoEvent": {},
    "bgm": "cave.opus",
    "beforeBattle": {},
    "bg2map": [

],
    "fg2map": [

],
    "cannotMoveIn": {}
}