main.floors.MT1=
{
    "floorId": "MT1",
    "title": "点光源-1",
    "name": "1",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "cave.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,1": [
            "本层将展示点光源插件的基础使用与效果"
        ],
        "4,5": [
            "这中间是一个固定的点光源，它是透明色的，表示其附近将完全展示成原来的样貌，位置为(112,208)，开始衰减半径为100，最大半径为300，受到墙壁遮挡，不跟随勇士。",
            "它的配置代码如下：\n{\n    id: 'mt0_1',\n    x: 112,\n    y: 208,\n    decay: 100,\n    r: 300,\n    color: '#0000'\n}"
        ],
        "9,1": [
            "点光源插件有对光源的配置，也有对其他内容的配置。",
            "首先，对一个楼层应当有一个背景色的配置，例如本层的背景色是一个半透明的黑色(#0008)，这个值表示r g b均为0，a为88，十六进制，因此为半透明的黑色。\n颜色一共有以下几种格式：\n#rgb\n#rgba\n#rrggbb\n#rrggbbaa\nrgb(r,g,b)\nrgba(r,g,b,a)\nhsl(h,s,l)\nhsla(h,s,l,a)",
            "除此之外，还有两个配置。\n一个是光浸入墙的程度，表示光能在墙壁内部穿透多少，例如本层为4，说明光会浸入墙壁中4个像素。\n另一个是光的模糊程度，例如本层为3，表示光拥有range为3px的高斯模糊。不用太理解什么是高斯模糊，什么是range，只需要知道这个值越大越模糊即可。调整该项可以提高视觉效果。"
        ],
        "7,10": [
            "这里有一个不被墙壁遮挡的光源，它的配置代码如下：\n{\n    id: 'mt1_2',\n    x: 240,\n    y: 336,\n    decay: 50,\n    r: 150,\n    color: '#0000',\n    noShelter: true\n}"
        ],
        "9,8": [
            "当然光源还可以是其他颜色，例如这就是一个蓝色光源",
            "它的配置代码如下：\n{\n    id: 'mt1_3',\n    x: 336,\n    y: 272,\n    decay: 50,\n    r: 200,\n    color: '#5bf3'\n}"
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,13": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,  0,  0,  0,129,  0, 88,  0,129,  0,  0,  0,  0,  1],
    [  1,  0,  1,  0,  0,  1,  0,  0,  0,  1,  0,  0,  0,  0,  1],
    [  1,  0,  1,  1,  1,  1,  0,  0,  1,  1,  0,  1,  1,  0,  1],
    [  1,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  1,  0,  1],
    [  1,  0,  1,  0,129,  0,  1,  0,  1,  1,  1,  1,  1,  0,  1],
    [  1,  0,  0,  0,  0,  0,  1,  0,  0,  1,  0,  0,  0,  0,  1],
    [  1,  0,  1,  0,  1,  0,  0,  0,  0,  0,  0,  0,  1,  0,  1],
    [  1,  0,  0,  0,  0,  0,  1,  1,  1,129,  0,  0,  1,  0,  1],
    [  1,  1,  1,  0,  1,  0,  0,  0,  0,  0,  0,  0,  1,  0,  1],
    [  1,  0,  0,  0,  1,  0,  1,129,  1,  0,  1,  0,  1,  1,  1],
    [  1,  0,  1,  1,  1,  0,  1,  1,  1,  0,  1,  0,  1,  0,  1],
    [  1,  0,  1,  0,  1,  0,  0,  1,  0,  0,  1,  1,  1,  0,  1],
    [  1,  0,  0,  0,  0,  0,  0, 87,  0,  0,  0,  0,  0,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}