main.floors.MT11=
{
    "floorId": "MT11",
    "title": "草原",
    "name": "11",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "grass.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,11": [
            "设定说明之额外伤害",
            "这是一种无法被减免的伤害，在破防的基础上，会在计算过每回合造成伤害后将额外伤害加在每回合伤害上",
            "例如，你对A怪物每回合造成10点伤害，你有10点额外伤害，那么这时候你每回合就可以对它造成20点伤害",
            "该属性对坚固怪同样有效"
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT10",
            "loc": [
                7,
                0
            ]
        },
        "7,0": {
            "floorId": "MT12",
            "loc": [
                7,
                14
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 91, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 33,  0,369,  0,  0, 20, 33,  0,373,  0, 20, 29,  0, 20],
    [ 20,  0,381, 20,  0,  0, 20,  0,  0, 20, 28, 20,  0, 33, 20],
    [ 20, 20, 20, 20,368, 20, 20, 20, 20, 20,  0, 20, 20,  0, 20],
    [ 20,  0, 28,369, 33,  0,369, 27,  0, 20, 33,369,  0, 28, 20],
    [ 20, 33,  0, 20,  0,  0, 20,  0, 27,368,  0, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20,276, 20,  0, 29, 20],
    [ 20, 34,  0, 20,  0, 32, 20,  0, 27, 20,  0,372, 29,  0, 20],
    [ 20,  0, 29,368, 32, 29, 20, 33,  0,369, 32, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,372, 20, 20, 20, 20,  0,372,  0, 34, 20],
    [ 20, 34, 32, 20, 34,  0, 20,  0, 32, 28,224, 20, 29,  0, 20],
    [ 20, 29, 29,370,372, 20, 20,129, 20, 20,  0, 20,  0, 34, 20],
    [ 20, 29, 29, 20,  0, 27,368, 33, 33, 20, 32, 20, 20, 20, 20],
    [ 20, 32, 34, 20, 29,  0, 20, 33, 33,368,  0,276,  0, 34, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 93, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "weather": [
        "sun",
        8
    ]
}