main.floors.MT16=
{
    "floorId": "MT16",
    "title": "山顶",
    "name": "16",
    "width": 25,
    "height": 25,
    "canFlyTo": true,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "T331",
    "bgm": "mount.mp3",
    "color": null,
    "weather": [
        "cloud",
        2
    ],
    "firstArrive": [
        {
            "type": "pauseBgm"
        },
        {
            "type": "loadBgm",
            "name": "escape.mp3"
        },
        "\t[野蛮人]\b[up,hero]这里就是山顶了",
        "\t[野蛮人]\b[up,hero]砍一些柴火就赶快回去吧",
        "\t[野蛮人]\b[up,hero]不要待太久",
        "下面是一场追逐战，建议把音乐打开",
        "追逐战很简单，跑就完事了"
    ],
    "eachArrive": [
        {
            "type": "pauseBgm"
        }
    ],
    "parallelDo": "",
    "events": {
        "23,19": [
            {
                "type": "confirm",
                "text": "是否跳过追逐战",
                "yes": [
                    {
                        "type": "setValue",
                        "name": "flag:finishChase1",
                        "value": "true"
                    },
                    {
                        "type": "changeFloor",
                        "floorId": "MT14",
                        "loc": [
                            21,
                            7
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "T336",
                        "loc": [
                            [
                                25,
                                7
                            ]
                        ],
                        "floorId": "MT14"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.status.maps.MT14.canFlyFrom = false;\ncore.plugin.chase.chaseInit1();\n}"
                    },
                    {
                        "type": "show",
                        "loc": [
                            [
                                7,
                                1
                            ]
                        ],
                        "floorId": "MT14"
                    },
                    {
                        "type": "exit"
                    }
                ],
                "no": [
                    {
                        "type": "function",
                        "function": "function(){\ncore.plugin.replay.readyClip();\n}"
                    },
                    {
                        "type": "choices",
                        "text": "请选择难度",
                        "choices": [
                            {
                                "text": "简单（显示逃跑路线）",
                                "color": [
                                    0,
                                    255,
                                    93,
                                    1
                                ],
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "flag:chaseHard",
                                        "value": "0"
                                    }
                                ]
                            },
                            {
                                "text": "困难（不显示逃跑路线）",
                                "color": [
                                    255,
                                    0,
                                    0,
                                    1
                                ],
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "flag:chaseHard",
                                        "value": "1"
                                    }
                                ]
                            }
                        ]
                    },
                    "追逐战后录像会进行自动修复，不用担心录像问题",
                    {
                        "type": "hideStatusBar",
                        "toolbox": true
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.status.maps.MT15.canFlyFrom = false\n}"
                    }
                ]
            },
            {
                "type": "forbidSave",
                "forbid": true
            },
            {
                "type": "show",
                "loc": [
                    [
                        7,
                        1
                    ]
                ],
                "floorId": "MT14"
            },
            {
                "type": "playBgm",
                "name": "escape.mp3",
                "keep": true
            },
            {
                "type": "animate",
                "name": "amazed",
                "async": true
            },
            {
                "type": "sleep",
                "time": 1000
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "moveHero",
                "time": 1000,
                "steps": [
                    "backward:3"
                ]
            },
            {
                "type": "setViewport",
                "dxy": [
                    0,
                    -2
                ],
                "time": 500
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]狼！",
                "time": 2000
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]在睡觉",
                "time": 2000
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]悄悄过去把它打死",
                "time": 3000
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]千万不能惊动它",
                "time": 2600
            },
            {
                "type": "setViewport",
                "dxy": [
                    0,
                    2
                ],
                "time": 500
            },
            {
                "type": "moveHero",
                "time": 600,
                "steps": [
                    "up:10"
                ]
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 75,
                "moveMode": "easeIn"
            },
            {
                "type": "setBlock",
                "number": "A506",
                "loc": [
                    [
                        23,
                        8
                    ]
                ]
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    0
                ],
                "time": 300,
                "moveMode": "easeOut"
            },
            {
                "type": "setCurtain",
                "time": 0
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]！！！！！",
                "time": 2000
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]它醒了",
                "time": 2000
            },
            {
                "type": "move",
                "loc": [
                    23,
                    8
                ],
                "time": 300,
                "keep": true,
                "steps": [
                    "down:1"
                ]
            },
            {
                "type": "sleep",
                "time": 200,
                "noSkip": true
            },
            {
                "type": "moveHero",
                "time": 300,
                "steps": [
                    "backward:1"
                ]
            },
            {
                "type": "sleep",
                "time": 200,
                "noSkip": true
            },
            {
                "type": "move",
                "loc": [
                    23,
                    9
                ],
                "time": 300,
                "keep": true,
                "steps": [
                    "down:1"
                ]
            },
            {
                "type": "sleep",
                "time": 200,
                "noSkip": true
            },
            {
                "type": "moveHero",
                "time": 300,
                "steps": [
                    "backward:1"
                ]
            },
            {
                "type": "sleep",
                "time": 200,
                "noSkip": true
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]糟了，我可打不过它",
                "time": 3000
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]跑，只能跑了！",
                "time": 3000
            },
            {
                "type": "moveHero",
                "time": 200,
                "steps": [
                    "backward:9"
                ]
            },
            {
                "type": "jump",
                "from": [
                    23,
                    10
                ],
                "dxy": [
                    0,
                    2
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "sleep",
                "time": 1000,
                "noSkip": true
            },
            {
                "type": "jump",
                "from": [
                    23,
                    12
                ],
                "dxy": [
                    0,
                    2
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "sleep",
                "time": 1000,
                "noSkip": true
            },
            {
                "type": "jump",
                "from": [
                    23,
                    14
                ],
                "dxy": [
                    0,
                    3
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "sleep",
                "time": 1000,
                "noSkip": true
            },
            {
                "type": "autoText",
                "text": "\t[野蛮人]\b[up,hero]跑，快跑！！！！！！！！！",
                "time": 3000
            },
            {
                "type": "function",
                "function": "function(){\ncore.startChase(1);\n}"
            },
            {
                "type": "autoSave"
            }
        ],
        "2,23": [
            "这里是漏怪检测，将会检测\r[gold]洞穴、山路、山脚、平原\r[white]地区的怪物是否清完",
            {
                "type": "function",
                "function": "function(){\nconst enemy = Mota.Plugin.require('remainEnemy_g').getRemainEnemyString(core.floorIds.slice(5, 17));\nif (enemy.length === 0) {\n\tcore.insertAction(['当前无剩余怪物！', { \"type\": \"hide\", \"remove\": true }, ]);\n} else {\n\tcore.insertAction(enemy);\n}\n}"
            },
            {
                "type": "loadBgm",
                "name": "escape.mp3"
            }
        ],
        "3,23": [
            "即将开始追逐战，最好打开背景音乐，有耳机尽量佩戴耳机，这样游戏体验更佳",
            "为了防止你撞上不该开的门，现在会将所有门打开，并删除所有物品",
            "追逐的时候不能用2技能，不能用楼传，逃跑后要原路返回山洞",
            "追逐战分为两个难度，简单难度会显示逃跑路径，困难模式不显示，困难模式逃跑成功可以获得成就",
            "前方会有大约40秒的剧情，之后开始追逐战并自动存档，如果逃跑失败需要重打，可以直接读自动存档",
            "\t[野蛮人]\b[up,hero]这墙上有文字？",
            "\t[野蛮人]\b[up,hero]真相就藏在智慧之塔中，而想要到达智慧之塔，你必须经过勇气的考验，通过勇气之路。",
            "\t[野蛮人]\b[up,hero]智慧之塔？勇气之路？",
            "\t[野蛮人]\b[up,hero]算了，先砍柴吧。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "0,23": {
            "floorId": "MT15",
            "loc": [
                63,
                4
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [20076,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20054,20075],
    [20047,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20057,20045],
    [20047,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20065,20045],
    [20047,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30174,30175,  0,20045],
    [20047,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30182,30183,  0,20045],
    [20047,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30190,30191,  0,20045],
    [20047,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30198,30199,  0,20045],
    [20047,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30206,30207,  0,20045],
    [20047,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30174,30175,507,20045],
    [20047,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30182,30183,  0,20045],
    [20047,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30190,30191,  0,20045],
    [20047,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30198,30199,  0,20045],
    [20047,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30206,30207,  0,20045],
    [20047,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30174,30175,  0,20045],
    [20047,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30182,30183,  0,20045],
    [20047,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30190,30191,  0,20045],
    [20047,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30198,30199,  0,20045],
    [20047,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30206,30207,  0,20045],
    [20047,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30128,30129,30130,30131,30174,30175,  0,20045],
    [20047,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30136,30137,30138,30139,30182,30183,  0,20045],
    [20055,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30144,30145,30146,30147,30190,30191,  0,20045],
    [20058,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30152,30153,30154,30155,30198,30199,  0,20045],
    [20074,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30160,30161,30162,30163,30206,30166,  0,20045],
    [ 92,  0,516,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20045],
    [20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20038,20067]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "bg2map": [

],
    "fg2map": [

],
    "cannotMoveIn": {}
}