main.floors.MT2=
{
    "floorId": "MT2",
    "title": "点光源-2",
    "name": "2",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "cave.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,12": [
            "本层光源配置如下：\n{\n    id: 'mt2_1',\n    x: 0,\n    y: 0,\n    decay: 50,\n    r: 200,\n    color: '#0000',\n    followHero: true\n}",
            "当跟随勇士时，x和y表示光源偏移勇士的量"
        ],
        "9,12": [
            "你也可以设置让光源跟随勇士，配合这个功能可以做出一些很奇妙的效果，例如本层。",
            "本层是一个迷宫，背景色为纯黑(#000)，光源为透明色(#0000)，尝试走出这个迷宫吧！走不出去的话可以开楼传或者浏览地图。"
        ]
    },
    "changeFloor": {
        "7,13": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "7,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,  1,  0,  1,  0,  0, 87,  0,  1,  0,  0,  1,  0,  1],
    [  1,  0,  0,  0,  1,  0,  1,  1,  1,  1,  0,  1,  1,  0,  1],
    [  1,  0,  1,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1],
    [  1,  0,  1,  0,  1,  1,  1,  1,  1,  1,  1,  1,  1,  0,  1],
    [  1,  0,  1,  0,  0,  0,  0,  0,  1,  0,  0,  0,  1,  0,  1],
    [  1,  0,  1,  1,  1,  1,  0,  1,  1,  0,  1,  0,  1,  0,  1],
    [  1,  0,  0,  1,  0,  0,  0,  0,  1,  0,  1,  0,  0,  0,  1],
    [  1,  1,  0,  1,  0,  1,  0,  0,  0,  0,  1,  1,  1,  0,  1],
    [  1,  0,  0,  1,  0,  1,  0,  1,  1,  1,  1,  1,  1,  0,  1],
    [  1,  0,  1,  1,  0,  1,  0,  0,  0,  0,  0,  0,  1,  0,  1],
    [  1,  0,  0,  0,  0,  1,  1,  0,  1,  1,  1,  0,  1,  0,  1],
    [  1,  0,  1,  1,  0,129,  0,  0,  0,129,  1,  0,  1,  1,  1],
    [  1,  0,  0,  1,  0,  1,  0, 88,  0,  1,  1,  0,  0,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}