main.floors.MT6=
{
    "floorId": "MT6",
    "title": "草原",
    "name": "6",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "grass.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[原始人]\b[down,hero]感觉今天和之前有些不大一样",
        "\t[原始人]\b[down,hero]......",
        "\t[原始人]\b[down,hero]等一下，草地上那是什么？",
        "\t[智慧结晶]\b[down,4,4]我是智慧的结晶，存储着大量的智慧",
        "\t[原始人]\b[down,hero]？还会说话？",
        "\t[智慧结晶]\b[down,4,4]不要大惊小怪，我只是后人的智慧凝结而成的结晶罢了",
        "\t[智慧结晶]\b[down,4,4]你可以吸收我的智慧，来让你更有智慧",
        "\t[智慧结晶]\b[down,4,4]这样，你便能做一些其他你现在做不到事情",
        "\t[原始人]\b[down,hero]所以，我只要把你拿在手上就行了？",
        "\t[智慧结晶]\b[down,4,4]不，你只需要捏碎我，便可吸收我的全部智慧",
        "\t[智慧结晶]\b[down,4,4]至于我会说话，只是后人给我的特有功能，让你知道我的能力而已",
        "\t[智慧结晶]\b[down,4,4]这个功能会在我完成任务后自动关闭",
        "\t[智慧结晶]\b[down,4,4]也就是说，马上我就不会说话了",
        "\t[智慧结晶]\b[down,4,4]现在，你懂我的能力了吗？",
        "\t[原始人]\b[down,hero]大概...懂了吧",
        "\t[智慧结晶]\b[down,4,4]嗯，那我就离开了，记得捏碎我哦！",
        "\t[原始人]\b[down,hero].......",
        "\t[原始人]\b[down,hero]试着去捏碎它吧",
        {
            "type": "function",
            "function": "function(){\ncore.displayChapter(1);\n}"
        },
        {
            "type": "setValue",
            "name": "flag:chapter",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "item:skill1",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "item:cross",
            "value": "1"
        },
        {
            "type": "sleep",
            "time": 3000,
            "noSkip": true
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,5": [
            "开启技能后当前技能会在地图名右方显示",
            "点开生命之泉技能后距离加生命回复剩余血瓶量会在生命回复上方显示"
        ],
        "2,3": [
            {
                "type": "changeFloor",
                "floorId": "MT5",
                "loc": [
                    14,
                    7
                ],
                "direction": "left"
            },
            {
                "type": "setGlobalValue",
                "name": "animateSpeed",
                "value": 277.7778
            }
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT7",
            "loc": [
                7,
                0
            ]
        },
        "14,7": {
            "floorId": "MT10",
            "loc": [
                0,
                7
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "4,4": [
            {
                "type": "sleep",
                "time": 1000
            },
            "\t[原始人]\b[down,hero].......",
            "\t[原始人]\b[down,hero]感觉一些很深奥的东西流入了大脑",
            "\t[原始人]\b[down,hero]果然可以提高我的智慧吗？",
            "\t[原始人]\b[down,hero]看来我可以利用这些智慧来干些事情了",
            "现在开启了智慧加点功能，该功能将会贯穿整个游戏，下面请仔细阅读玩法",
            "人生不能后悔，一旦加过点后，便再也没有办法悔掉，加点时请慎重选择",
            "很多技能都有多个等级，升级需要消耗更多智慧，但收益也会随之增多",
            "有一些技能为必点技能，这些技能会在说明中特别指出，请尽快早点点这些技能，否则可能会导致游戏无法进行",
            "你可以通过拾取绿宝石来获取智慧，拥有足够的智慧后请尽快加点",
            "合理分配技能是该塔的关键，所以请加点时慎重选择",
            "按J或者点击状态栏的技能树可以打开技能树",
            "祝您游戏愉快！",
            {
                "type": "openDoor",
                "loc": [
                    2,
                    10
                ]
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [30048,  0,  0,30050, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [30056,30057,30057,30058,  0,  0, 29, 20, 32, 29,372,  0,276, 29, 20],
    [30064,30060,30118,30066,  0,  0,  0, 20, 29, 34, 20,  0, 20, 20, 20],
    [30072,30073,30126,30074,  0,  0, 32, 20, 20, 20, 20, 31,  0, 31, 20],
    [ 20,  0,  0,  0, 29,  0,  0, 20,  0,  0,204,  0, 31,  0, 20],
    [ 20,  0,  0,  0,  0,129, 29,267,  0,  0, 20,276, 20, 20, 20],
    [ 20,  0,  0,  0,  0,  0, 20, 20, 20, 29, 20,  0,  0,  0, 20],
    [30060,30112,30113,30114,30065,30066,  0, 34,  0,  0, 20, 29, 20,368, 94],
    [30073,30112,30113,30114,30073,30074, 20, 20, 20,209,  0, 34,  0,  0, 20],
    [ 20,30120,30121,30122, 20,  0,  0,276,  0,  0, 20,248, 20, 20, 20],
    [ 20, 20, 85, 20, 20, 20, 20, 32, 20, 32, 20, 32,  0, 32, 20],
    [ 20,  0,  0,  0, 20,  0, 20,  0, 20, 20, 20,  0, 29,  0, 20],
    [ 20,  0, 27,  0,214, 33,204, 29,224, 32,  0,368, 20, 20, 20],
    [ 20,  0,  0,  0, 20,  0, 20, 32, 20,  0, 20, 29,  0, 29, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 93, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,30050,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30050,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30050,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30050,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30050,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30050,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30057,30104,30105,30106,30057,30058,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,30065,30065,30065,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,30073,30073,30073,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "beforeBattle": {},
    "weather": [
        "sun",
        8
    ],
    "cannotMoveIn": {},
    "bg2map": [

],
    "fg2map": [

]
}