main.floors.MT93=
{
    "floorId": "MT93",
    "title": "苍蓝之殿-右上",
    "name": "93",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 8,
    "defaultGround": "T650",
    "bgm": "palaceNorth.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,7": {
            "floorId": "MT91",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "10,7": [
            {
                "type": "setValue",
                "name": "flag:door_palace",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_palace===4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            7,
                            4
                        ],
                        "floorId": "MT72"
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            4,
                            7
                        ],
                        "floorId": "MT72"
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            7,
                            10
                        ],
                        "floorId": "MT72"
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            10,
                            7
                        ],
                        "floorId": "MT72"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_palace",
                        "value": "null"
                    },
                    "苍蓝之殿中心处的机关门已经开启，进入后会到达本章最后一个小区域"
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [648,648,648,648,648,648,648,648,648,648,648,648,648,648,648],
    [648,  0,491,  0,648,  0,648,  0,491,  0,648,  0,491,  0,648],
    [648, 28,  0, 29,578,491,648,378,  0,381,648,381,  0,376,648],
    [648,648,648,648,648,  0,648,648,648,232,648,648,648,671,648],
    [648, 27,  0, 29,249,491,648, 27,  0, 28,  0,  0,  0,  0,648],
    [648,  0,491,  0,648,  0,648,  0,491,  0,648,648,648,648,648],
    [648,648,648,648,648,682,648,648,648,677,648,466,  0,467,648],
    [ 92,  0,  0,  0,  0,  0,513,  0,487,  0,693,  0,665,  0,648],
    [648,648,648,648,648,682,648,648,648,677,648,468,  0,695,648],
    [648,  0,491,  0,648,  0,648,  0,491,  0,648,648,648,648,648],
    [648, 28,  0, 29,249,491,648, 28,  0, 27,  0,  0,  0,  0,648],
    [648,648,648,648,648,  0,648,648,648,232,648,648,648,671,648],
    [648, 27,  0, 29,578,491,648,376,  0,381,648,381,  0,378,648],
    [648,  0,491,  0,648,  0,648,  0,491,  0,648,  0,491,  0,648],
    [648,648,648,648,648,648,648,648,648,648,648,648,648,648,648]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}