main.floors.MT48=
{
    "floorId": "MT48",
    "title": "冰封高原",
    "name": "48",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 8,
    "defaultGround": "T580",
    "bgm": "winter.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,0": [
            "本塔的第二章测试版已结束。",
            "本章还剩余最后一个大区域，约30层，较为复杂，请期待下次更新。",
            "计分方式：血量/10+黄*2000+蓝*5000+红*10000",
            {
                "type": "setValue",
                "name": "status:hp",
                "operator": "/=",
                "value": "10"
            },
            {
                "type": "setValue",
                "name": "status:hp",
                "operator": "+=",
                "value": "item:yellowKey*2000+item:blueKey*5000+item:redKey*10000"
            },
            {
                "type": "function",
                "function": "function(){\ncore.status.hero.hp = Math.ceil(core.status.hero.hp);\n}"
            },
            {
                "type": "win",
                "reason": "第二章测试"
            }
        ],
        "7,10": [
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]你来了，智慧之神看中的人。",
            "\t[中级智人]\b[up,hero]你是什么人？",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]苍蓝之灵。",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]我跟你之前见到的智慧之神是同一时期的产物。",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]你应该也知道当时发生了什么。",
            "\t[中级智人]\b[up,hero]那你又为何出现在这里呢？",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]抬头，看到那宏伟的宫殿了吗？（玩家视角应该看不到）",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]那便是未来之人做下的最后赌注 - 苍蓝之殿。",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]你现在还有很多疑虑吧，那里便有你想要找的答案。",
            "\t[中级智人]\b[up,hero]那么我怎么过去？",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]打败我，你便有资格进入。",
            "\t[中级智人]\b[up,hero]为什么又是要打架？",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]......",
            "\t[苍蓝之灵-虚,E647]\b[up,7,7]之后，你会明白的。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT47",
            "loc": [
                7,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "7,7": [
            "\t[中级智人]\b[up,hero]为什么，为什么一定要打架，决定胜负呢？",
            {
                "type": "openDoor",
                "loc": [
                    7,
                    3
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [146,146,146,146,146,146,604,  0,604,146,146,146,146,146,146],
    [146,146,146,146,  0,  0,604,  0,604,  0,146,146,  0,  0,146],
    [  0,  0,  0,  0,  0,  0,604,  0,604,  0,  0,146,146,  0,146],
    [587,  0,584,584,584,584,584, 85,584,584,584,584,584,  0,146],
    [587,  0,584,  0,  0,  0,584,  0,584,  0,  0,  0,584,  0,  0],
    [587,  0,584,  0,  0,  0,584,  0,584,  0,  0,  0,584,588,588],
    [587,  0,584,  0,466,  0,584,  0,584,  0,467,  0,584,  0,588],
    [  0,  0,584,  0,  0,491,  0,647,  0,491,  0,  0,584,  0,588],
    [  0,  0,584,  0,468,  0,584,  0,584,  0,468,  0,584,  0,588],
    [  0,588,584,  0,  0,  0,584,  0,584,  0,  0,  0,584,  0,  0],
    [  0,588,584,  0,  0,  0,584,  0,584,  0,  0,  0,584,604,  0],
    [588,588,584,584,584,584,584,492,584,584,584,584,584,604,  0],
    [  0,  0,  0,  0,  0,  0,604,  0,604,  0,  0,  0,  0,604,  0],
    [  0,  0,  0,  0,  0,  0,604,  0,604,  0,  0,  0,  0,  0,  0],
    [586,586,586,  0,  0,  0,604, 93,604,  0,  0,  0,588,588,588]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,70056, 91,70058,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,70056,  0,70058,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,70056,  0,70058,  0,  0,  0,  0,  0,  0],
    [  0,  0,70048,70049,70049,70049,70051,  0,70052,70049,70049,70049,70050,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70056,  0,  0,  0,  0,  0,  0,  0,  0,  0,70058,  0,  0],
    [  0,  0,70064,70065,70065,70065,70059,  0,70060,70065,70065,70065,70066,  0,  0],
    [  0,  0,70072,70073,70073,70073,70056,  0,70058,70073,70073,70073,70074,  0,  0],
    [  0,  0,70080,70081,70081,70081,70056,  0,70058,70081,70081,70081,70082,  0,  0],
    [  0,  0,  0,  0,  0,  0,70056,  0,70058,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}